Example_2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   .01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo	0.5;

maxDeltaT 0.01; 

functions
{
	wallShearStress1
	{
   		// Mandatory entries (unmodifiable)
   		type            wallShearStress;
   		libs            ("libfieldFunctionObjects.so");

   		// Optional entries (runtime modifiable)
   		patches         ("WALL");

   		// Optional (inherited) entries
   		writePrecision  6;
    		writeToFile     true;
    		useUserTime     true;
    		//region          region0;
    		enabled         true;
   		log             true;
    		//timeStart       0;
    		//timeEnd         50;
   		executeControl  writeTime;
    		executeInterval 1;
    		writeControl    writeTime;
   		writeInterval   1;

	}
}

// ************************************************************************* //
