Example_2/0/c0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      c0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0.0;

boundaryField
{
    INLET
    {
        type            uniformFixedValue;
	uniformValue	2.86e-9;
    }
    WALL
    {
   	type            codedFixedValue;
	value		uniform 0.0;

    	name robinBC;
    
    	code
    	#{
    		const scalar Vw = 4e-8;
   		const scalar gammac0 = 5.983e-12;
      		scalarField Cc = this->patchInternalField();
   		vectorField delta = this->patch().delta();
      		vectorField norm = this->patch().nf();
      		scalarField res = (Cc)/(1-mag(delta & norm)*Vw/gammac0);
      		operator == (res);
    	#};
    }  
    OUTLET_1
    {
        type            zeroGradient;
    }
    OUTLET_2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
